Bartosz Stokłosa

Gr 1

In [64]:
# pip install sqlalchemy psycopg2 pandas

1.

In [65]:
from lzma import FORMAT_ALONE
from tkinter.tix import Select
import psycopg2 as pg
import pandas as pd
from pandas import read_sql

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

df = read_sql('select distinct name from category',con=connection)
print(df.size)

16

2.

In [66]:
df = read_sql('select name from category order by name asc',con=connection)
print(df)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

3.

In [67]:
df = read_sql('select release_year from film order by release_year asc',con=connection)
print(df["release_year"].iloc[0] == df["release_year"].iloc[-1])
# Wszystkie daty wyporzyczenia filmów są takie same

True

Ta sama data

4.

In [68]:
df = read_sql("select count(rental_date) from rental where rental_date BETWEEN '2005-07-01 00:00:00'::timestamp AND '2005-08-01 24:00:00'::timestamp",con=connection)

print((df))

   count
0   7380

5.

In [69]:
df = read_sql("select count(rental_date) from rental where rental_date BETWEEN '2010-02-01 00:00:00'::timestamp AND '2011-01-01 24:00:00'::timestamp",con=connection)

print((df))

   count
0      0

6.

In [70]:
df = read_sql("SELECT DISTINCT ON (amount) amount, payment_id FROM payment ORDER BY amount DESC LIMIT 1",con=connection)

print((df))

   amount  payment_id
0   11.99       23757

7.

In [71]:
df = read_sql("SELECT customer_id, first_name, last_name, country.country FROM customer INNER JOIN address ON address.address_id = customer.address_id INNER JOIN city ON address.city_id = city.city_id INNER JOIN country ON country.country_id = city.country_id where country.country = 'Poland' OR country.country='Nigeria' OR country.country='Bangladesh'",con=connection)

print(df)

    customer_id first_name  last_name     country
0           284      Sonia    Gregory     Nigeria
1           318      Brian      Wyman      Poland
2           572     Sidney   Burleson      Poland
3           409     Rodney    Moeller     Nigeria
4           332    Stephen     Qualls  Bangladesh
5           286      Velma      Lucas     Nigeria
6            80    Marilyn       Ross     Nigeria
7           198      Elsie     Kelley     Nigeria
8           103     Gladys   Hamilton     Nigeria
9           329      Frank   Waggoner  Bangladesh
10          128   Marjorie     Tucker      Poland
11           18      Carol     Garcia     Nigeria
12          270       Leah     Curtis      Poland
13          501      Ruben      Geary      Poland
14          277       Olga    Jimenez     Nigeria
15          156     Bertha   Ferguson     Nigeria
16          280     Tracey    Barrett     Nigeria
17          250         Jo     Fowler     Nigeria
18          571    Johnnie   Chisholm      Poland
19          562    Wallace      Slone     Nigeria
20           21   Michelle      Clark  Bangladesh
21          380    Russell    Brinson      Poland
22          558     Jimmie  Eggleston      Poland
23          232  Constance       Reid     Nigeria

8.

In [76]:
df = read_sql("SELECT staff_id, first_name, last_name, country.country FROM staff INNER JOIN address ON address.address_id = staff.address_id INNER JOIN city ON address.city_id = city.city_id INNER JOIN country ON country.country_id = city.country_id",con=connection)

print(df)

   staff_id first_name last_name    country
0         1       Mike   Hillyer     Canada
1         2        Jon  Stephens  Australia

9.

In [72]:
df = read_sql("SELECT staff_id, first_name, last_name, country.country FROM staff INNER JOIN address ON address.address_id = staff.address_id INNER JOIN city ON address.city_id = city.city_id INNER JOIN country ON country.country_id = city.country_id where country.country='Spain' OR country.country='Argentina'",con=connection)

print(df)
#DB jest pysty czyli nie ma żadnych pracowników z Hiszpani lub z Argentyny

Empty DataFrame
Columns: [staff_id, first_name, last_name, country]
Index: []

10.

In [73]:
df = read_sql("SELECT DISTINCT category.name FROM rental INNER JOIN inventory ON inventory.inventory_id = rental.inventory_id INNER JOIN film ON film.film_id = inventory.film_id INNER JOIN film_category ON film.film_id = film_category.film_id INNER JOIN category ON film_category.category_id = category.category_id ", con=connection)

print(df)

           name
0        Sports
1      Classics
2           New
3        Family
4        Comedy
5     Animation
6        Travel
7         Music
8         Drama
9        Horror
10       Sci-Fi
11        Games
12  Documentary
13      Foreign
14       Action
15     Children

11.

In [77]:
df = read_sql("SELECT DISTINCT category.name FROM rental INNER JOIN inventory ON inventory.inventory_id = rental.inventory_id INNER JOIN film ON film.film_id = inventory.film_id INNER JOIN film_category ON film.film_id = film_category.film_id INNER JOIN category ON film_category.category_id = category.category_id INNER JOIN customer ON rental.customer_id = customer.customer_id INNER JOIN address ON address.address_id = customer.address_id INNER JOIN city ON address.city_id = city.city_id INNER JOIN country ON country.country_id = city.country_id where country.country ='United States'", con=connection)

print(df)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

12.

In [75]:
df = read_sql("SELECT title FROM film INNER JOIN film_actor ON film_actor.film_id = film.film_id INNER JOIN actor ON actor.actor_id = film_actor.actor_id where (actor.first_name = 'Olympia' AND actor.last_name = 'Pfeiffer') OR (actor.first_name = 'Julia' AND actor.last_name = 'Zellweger') OR (actor.first_name = 'Ellen' AND actor.last_name = 'Presley')", con=connection)

print(df)

                title
0     Bilko Anonymous
1   Caribbean Liberty
2    Casper Dragonfly
3    Empire Malkovich
4       Floats Garden
..                ...
64       Outlaw Hanky
65    Panky Submarine
66   Rider Caddyshack
67          Won Dares
68      Wyoming Storm

[69 rows x 1 columns]